Config = {}

--------------------------- [กำหนด Base] ---------------------------

Config.Base = '1.2'             -- 1.1 / 1.2 เลือก Base ว่าคุณใช้ Base ไหนอยู่

--------------------------- [เกี่ยวกับ ไอเทม] ---------------------------

Config.ItemsUse = "map"         -- ชื่อไอเทมที่ใช้งาน เมื่อกดใช้แล้วจะมีจุดให้เก็บสมบัติ
Config.RemoveItem = true        -- ต้องการ ลบไอเทม หลังจากใช้งานไหม true = ลบ | false = ไม่ลบ
Config.ItemsCountRemove = 1     -- จำนวนไอเทมที่ลบ

Config.Items = {    -- เกี่ยวกับไอเทม
    Item = {
        Itemname = 'water',     -- ชื่อไอเทมที่ดรอป
        Itemcount = {1, 4},     -- จำนวนไอเทมที่ดรอป (สุ่มได้ ถ้าอยากให้ได้ 1 ชิ้น ให้เปลี่ยนเป็น {1, 1} )
        bonusOnOff = true,      -- เปิดปิดไอเทมโบนัส ว่าจะให้ดรอปหรือไม่
        bonus = { -- สามาถเพิ่มได้หลายอย่าง
            {
                itembonus = "bread",       -- ชื่อไอเทมโบนัส 
                bonuscount = {1, 4},       -- จำนวนไอเทมโบนัส
                bonusdroprate = 100        -- % การดรอปของไอเทมโบนัส
            }
            -- {
            --     itembonus = "bread",       -- ชื่อไอเทมโบนัส 
            --     bonuscount = {1, 4},       -- จำนวนไอเทมโบนัส
            --     bonusdroprate = 100        -- % การดรอปของไอเทมโบนัส
            -- },
            -- {
            --     itembonus = "bread",       -- ชื่อไอเทมโบนัส 
            --     bonuscount = {1, 4},       -- จำนวนไอเทมโบนัส
            --     bonusdroprate = 100        -- % การดรอปของไอเทมโบนัส
            -- },
            -- {
            --     itembonus = "bread",       -- ชื่อไอเทมโบนัส 
            --     bonuscount = {1, 4},       -- จำนวนไอเทมโบนัส
            --     bonusdroprate = 100        -- % การดรอปของไอเทมโบนัส
            -- }    -- อันสุดท้ายต้องไม่มี , ไว้ด้านหลัง
        }
    }
}

--------------------------- [กำหนดจุด] ---------------------------

Config.Treasure = { -- เซ็ตจุดสมบัติ (เซ็ตมาให้แล้วที่บนเกาะ Cayo)
    {
        x = 3896.13,
        y = -4709.85,
        z = 4.74
    },
    {
        x = 4265.38,
        y = -4356.54,
        z = 20.86
    },
    {
        x = 4776.17,
        y = -4335.71,
        z = 12.09
    },
    {
        x = 4871.98,
        y = -4627.33,
        z = 14.62
    },
    {
        x = 4918.48,
        y = -4906.66,
        z = 3.45
    }
}

Config.grandZ = {0.0, 1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0, 10.0, 11.0, 12.0, 13.0, 14.0, 15.0, 16.0, 17.0, 18.0, 19.0, 20.0, 1000} -- ห้ามแตะต้องเด็ดขาด

--------------------------- [Blips] ---------------------------

Config.ShowBlips = true         -- ต้องการเปิด Blips ไหม true = เปิด | false = ปิด
Config.ShowBlipsRadius = true   -- ต้องการเปิด Blips Radius ไหม true = เปิด | false = ปิด

Config.Blips = {    -- Blips
    name = 'Treasure',      -- กำหนดชื่อของ Blip
    sprite = 161,           -- กำหนดรูปแบบของ Blip    (https://docs.fivem.net/docs/game-references/blips/) <--หาได้จากเว็บไซต์นี้
    scale = 1.0,            -- กำหนดขนาดของ Blip
    color = 27              -- กำหนดสีของ Blip     (https://docs.fivem.net/docs/game-references/blips/) <--หาได้จากเว็บไซต์นี้
}

Config.BlipsRadius = {
    sprite = 9,             -- กำหนดรูปแบบของ Blip    (https://docs.fivem.net/docs/game-references/blips/) <--หาได้จากเว็บไซต์นี้ 
    radius = 45.0,          -- ขนาดของ วง ในแมพ (แนะนำ 45.0 ต้องมีจุดด้านหลังด้วยถึงจะใช้งานได้)
    color = 27,             -- กำหนดสีของ Blip     (https://docs.fivem.net/docs/game-references/blips/) <--หาได้จากเว็บไซต์นี้
    intensity = 300         -- ความเข้มของสี 0-300 ค่ายิ่งเยอะยิ่งเข้ม
}

--------------------------- [การแจ้งเตือน] ---------------------------

Config.Text = { -- การแจ้งเตือนข้อความต่างๆ
    -- ฝั่ง Client
    ['CheckStatus'] = 'คุณเปิดแผนที่ล่าสมบัติไปแล้ว!',

    -- ฝั่ง Server
    -- 1.1
    ['header_text'] = 'แจ้งเตือน !',
    ['item_limit'] = 'ไอเทมของคุณเต็มแล้ว',
    ['item_bonus_limit'] = 'ไอเทมโบนัสของคุณเต็ม',
    -- 1.2
    ['item_weight'] = 'น้ำหนักของคุณเต็ม',
    ['item_bonus_weight'] = 'น้ำหนักของคุณเต็ม'
}
